/*Создать массив который содержит минимум 5 учеников  (алгоритм должен работать для любого количества учеников) и их оценки (минимум 4 оценки)
[
 {
	name: “First”,
	marks: [8, 10, 7, 5, 4]
 }
]
Написать следующие функции обработки этого массива: 
считает среднюю оценку и выводит имя и среднюю оценку для каждого элемента массива
выводит учеников со у которых средняя оценка < 5
находит учеников с максимальной и минимальной оценкой
сортирует учеников по средней оценке по убыванию (с самой большой средней в начале, с наименьшим в конце списка)
выводит тех учеников чья средняя оценка больше средней оценки всего класса */
let students = [
	{
		name: "Vasile Vieru",
		marks: [7, 9, 8, 10]
	},
	{
		name: "Eugen Doga",
		marks: [9, 9, 8, 7]
	},
	{
		name: "Olga Rusu",
		marks: [5, 6, 5, 7]
	},
	{
		name: "Igor Cuciuc",
		marks: [7, 2, 8, 9]
	},
	{
		name: "Gheorghe Topa",
		marks: [4, 3, 5, 7]
	},
];

function calcMark(arr) {
	let averageMark = 0;
	for(let 1 = 0; i < arr.name.length; i++) {

	}
}